import Goods from './data.d'

const goods: Array<Goods> = [
  {
    pic: './assets/g1.png',
    title: '椰云拿铁',
    desc: `1人份【年度重磅，一口吞云】
    √原创椰云topping，绵密轻盈到飞起！
    原创瑞幸椰云™工艺，使用椰浆代替常规奶盖
    打造丰盈、绵密，如云朵般细腻奶沫体验
    椰香清甜饱满，一口滑入口腔
    
    【饮用建议】请注意不要用吸管，不要搅拌哦~`,
    sellNumber: 200,
    favorRate: 95,
    price: 32,
    from: 0,
  },
  {
    pic: './assets/g2.png',
    title: '生椰拿铁',
    desc: `1人份【YYDS，无限回购】
    现萃香醇Espresso，遇见优质冷榨生椰浆，椰香浓郁，香甜清爽，带给你不一样的拿铁体验！
    
    主要原料：浓缩咖啡、冷冻椰浆、原味调味糖浆
    图片及包装仅供参考，请以实物为准。建议送达后尽快饮用。到店饮用口感更佳。`,
    sellNumber: 1000,
    favorRate: 100,
    price: 19.9,
    from: 0,
  },
  {
    pic: './assets/g3.png',
    title: '加浓 美式',
    desc: `1人份【清醒加倍，比标美多一份Espresso】
    口感更佳香醇浓郁，回味持久
    图片仅供参考，请以实物为准。建议送达后尽快饮用。`,
    sellNumber: 200,
    favorRate: 93,
    price: 20.3,
    from: 0,
  },
  {
    pic: './assets/g4.png',
    title: '瓦尔登蓝钻瑞纳冰',
    desc: `1人份【爆款回归！蓝色治愈力量】
    灵感来自下澄明、碧蓝之境---瓦尔登湖。含藻蓝蛋白，梦幻蓝色源自天然植物成分，非人工合成色素，融入人气冷榨生椰浆，椰香浓郁，清冽冰爽；底部添加Q弹小料，0脂原味晶球，光泽剔透，如钻石般blingbling。搭配奶油顶和彩虹色棉花糖，满足你的少女心～
    【去奶油小提示】由于去掉奶油后顶料口味会受影响，为保证口感，选择“去奶油”选项时将同时去掉奶油及顶料，请注意哦！【温馨提示】瑞纳冰系列产品形态为冰沙，无法进行少冰、去冰操作，请您谅解。【图片仅供参考，请以实物为准】`,
    sellNumber: 17,
    favorRate: 80,
    price: 38,
    from: 1,
  },
  {
    pic: './assets/g5.png',
    title: '椰云精萃美式',
    desc: `1人份【不用吸管 大口吞云！】

    1杯热量*≈0.6个苹果！
    原创瑞幸椰云™工艺，将「椰浆」变成绵密、丰盈的“云朵”，口感绵密顺滑！0乳糖植物基，清爽轻负担！
    
    *数据引自《中国食物成分表》第六版，苹果每100克可食部分中能量约为53千卡，以每个苹果250克/个计，1杯椰云精萃美式约80千卡，相当于约0.6个苹果。
    【图片仅供参考，请以实物为准】`,
    sellNumber: 50,
    favorRate: 90,
    price: 21.12,
    from: 1,
  },
  {
    pic: './assets/g6.png',
    title: '焦糖咖啡星冰乐',
    desc: `1人份【细腻醇香！】

    <含咖啡>星冰乐烘焙咖啡与牛奶和冰块一同搅打出细腻醇香的冰沙，浓郁焦糖酱在搅打稀奶油上旋转出夏日的雀跃！
    
    主要原料：焦糖味酱，牛奶，冰块，星冰乐咖啡风味糖浆，搅打稀奶油`,
    sellNumber: 55,
    favorRate: 86,
    price: 26.3,
    from: 2,
  },
  {
    pic: './assets/g7.png',
    title: '焦糖咖啡星冰乐',
    desc: `1人份【细腻醇香！】

    <含咖啡>星冰乐烘焙咖啡与牛奶和冰块一同搅打出细腻醇香的冰沙，浓郁焦糖酱在搅打稀奶油上旋转出夏日的雀跃！
    
    主要原料：焦糖味酱，牛奶，冰块，星冰乐咖啡风味糖浆，搅打稀奶油`,
    sellNumber: 45,
    favorRate: 89,
    price: 18.8,
    from: 2,
  },
  {
    pic: './assets/g8.png',
    title: '摩卡可可碎片星冰乐',
    desc: `1人份【浓郁醇香！】

    摩卡酱和咖啡在冰块的碰撞下魅力四射，可可碎片带来不同的口感，顶部覆以稀奶油与摩卡酱，让浓郁变得更加有趣。(可可碎片为代可可脂巧克力)！
    
    主要原料：星冰乐咖啡风味糖浆，摩卡酱，冰块，牛奶，搅打稀奶油`,
    sellNumber: 72,
    favorRate: 95,
    price: 29.9,
    from: 3,
  },
  {
    pic: './assets/g9.png',
    title: '红茶拿铁',
    desc: `1人份【茶瓦纳™】

    <不含咖啡>优质红茶在蒸奶中慢慢的呈现出温和的口感，以柔和的奶泡锁住茶香，加以经典风味酱。这是红茶与牛奶的对话，优雅品享红茶文化！
    
    主要原料：牛奶，香草味糖浆`,
    sellNumber: 23,
    favorRate: 94,
    price: 18.8,
    from: 4,
  },
  {
    pic: './assets/g10.png',
    title: '卡布奇诺',
    desc: `1人份【手工调制浓缩咖啡！】

    <含咖啡>蒸煮牛奶与浓缩咖啡相融合，用丰厚绵密的奶泡覆顶，再撒上肉桂粉或可可粉！
    
    温馨提示：在奶泡消融前，请尽快享用。`,
    sellNumber: 87,
    favorRate: 98,
    price: 25.6,
    from: 5,
  },
]

const menu: Array<string> = [
  '推荐',
  '热销',
  '折扣',
  '夏日冰咖必喝榜',
  '进店必喝',
  '只喝美式',
  '酷爽特调水果冰萃',
  '经典奶咖',
  '创意奶咖',
  '瑞纳冰季',
  '不喝咖啡',
  '轻食甜品',
  '热卖套餐',
]

export default { goods, menu }
